doc/contributing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 13:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to contribute</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">How to contribute</h1>
<p>
I&rsquo;m really glad you&rsquo;re reading this, because we need volunteer developers to
help this project continue to grow and improve.
</p>

<ol class="org-ol">
<li>File <a href="../../issues/new?assignees=&amp;labels=bug&amp;template=bug_report.md">bugs</a> and <a href="../../issues/new?assignees=&amp;labels=enhancement&amp;template=feature_request.md">enhancement requests</a>.</li>
<li>Review the project documentation know if you find are issues, or missing
content, there.</li>
<li>Fix or Add something and send us a pull request; you may like to pick up one of the issues marked <a href="../../labels/help%20wanted">help wanted</a> or <a href="../../labels/good%20first%20issue">good
first issue</a> as an introduction. Alternatively, <a href="../../labels/documentation">documentation</a> issues can be a great way to understand the project and
help improve the developer experience.</li>
</ol>

<div id="outline-container-orgcc8abec" class="outline-2">
<h2 id="orgcc8abec"><span class="section-number-2">1.</span> Submitting changes</h2>
<div class="outline-text-2" id="text-1">
<p>
We love pull requests from everyone. By participating in this project, you agree to abide by our <a href="./code_of_conduct.html">Code of Conduct</a>, and
<a href="../LICENSE">License</a>.
</p>

<p>
Fork, then clone the repo:
</p>

<pre class="example" id="org5c9fb5a">
❯ git clone git@github.com:johnstonskj/rust-sdml.git
</pre>

<p>
Ensure you have a good Rust install, usually managed by <a href="https://rustup.rs/">rustup</a>. You can ensure the latest tools with the following:
</p>

<pre class="example" id="org1c10fc2">
❯ rustup update
</pre>

<p>
Make your change. Add tests, and documentation, for your change. Ensure not only that tests pass, but the following all
run successfully.
</p>

<pre class="example" id="orgcbaeb78">
❯ cargo check --workspace --all-targets --all-features
❯ cargo fmt --all -- --check
❯ cargo clippy --workspace --all-targets --all-features -- -D warnings
</pre>

<p>
Make sure the tests pass. Note the three test passes which check for weird cases which can creap in with features.
</p>

<pre class="example" id="org797e81d">
❯ cargo test --workspace --no-fail-fast --all-features
❯ cargo test --workspace --no-fail-fast --all-targets --all-features
❯ cargo test --workspace --no-fail-fast --no-default-targets --all-features
❯ cargo doc --workspace --all-features --no-deps
</pre>

<p>
If you made changes to the book source, ensure the following runs successfully
</p>

<pre class="example" id="org9743c0d">
❯ mdbook build
</pre>

<p>
If you have made any changes to <code>Cargo.toml</code>, also check:
</p>

<pre class="example" id="org73d2b38">
❯ cargo audit
❯ cargo outdated --workspace --depth 1
</pre>

<p>
Push to your fork and <a href="../../compare/">submit a pull request</a> using our <a href="./pull_request_template.md">PR template</a>.
</p>

<p>
At this point you&rsquo;re waiting on us. We like to at least comment on pull requests within three business days (and,
typically, one business day). We may suggest some changes or improvements or alternatives.
</p>

<p>
Some things that will increase the chance that your pull request is accepted:
</p>

<ol class="org-ol">
<li>Write unit tests.</li>
<li>Write API documentation.</li>
<li>Write a <a href="https://cbea.ms/git-commit/https://cbea.ms/git-commit/">good commit message</a>.</li>
</ol>
</div>
</div>


<div id="outline-container-orgc300ef9" class="outline-2">
<h2 id="orgc300ef9"><span class="section-number-2">2.</span> Coding conventions</h2>
<div class="outline-text-2" id="text-2">
<p>
The primary tool for coding conventions is rustfmt, and specifically <code>cargo
fmt</code> is a part of the build process and will cause Actions to fail.
</p>

<p>
DO NOT create or update any existing <code>rustfmt.toml</code> file to change the default
formatting rules.
</p>

<p>
DO NOT alter any <code>warn</code> or <code>deny</code> library attributes. 
</p>

<p>
DO NOT add any <code>feature</code> attributes that would prohibit building on the stable
channel. In some cases new crate-level features can be used to introduce an
unstable feature dependency but these MUST be clearly documented and optional.
</p>

<p>
DO NOT introduce <code>unsafe</code> code without a discussion on alternatives first.
Ideally any unsafe code will be introduced as optional features.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-02-20 Tue 13:54</p>
</div>
</body>
</html>
